; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; PUERTO Ejercicio 1 de Daniel P. y Alejandro G.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain puerto)
  (:requirements :strips :typing)
  (:types cinta muelle grua pila altura contenedor - object)
  (:predicates 
		; Indica si un contenedor es verde
		(verde ?c - contenedor)

		; Indica si un contenedor es blanco (no verde)
		(no-verde ?x - (either pila contenedor))

		; Indica si una cinta o grua estan libres, es decir, sin contenedor
		(libre ?x - (either cinta grua))

		; Indica que contenedor1 esta sobre contenedor2, o en caso de no tener contenedor
		; abajo tiene la pila
		(encima ?c - contenedor ?x - (either pila contenedor))

		; Indica si una grua, pila o contenedor se encuentra en una cinta, muelle, grua o pila
		(ubicado-en ?x1 - (either grua pila contenedor) ?x2 - (either cinta muelle grua pila))

		; Indica cuando un contenedor puede ser cogido por la grua. Se permite el tipo pila
		; porque cuando se deja un contenedor en una pila hay que poner como no disponible
		; el contenedor que queda abajo, pero en caso de estar la pila vacia se necesita que
		; este predicado acepte el tipo pila
		(disponible ?x - (either pila contenedor))

		; Indica el contenedor que es el top de la pila, en caso de estar vacia la pila, la
		; pila es el top de la propia pila
		(top ?x - (either pila contenedor) ?pila2 - pila)

		; La cinta conecta muelle origen con muelle destino
		(conecta_a ?ct - cinta ?m_o - muelle ?m_d - muelle)

		; Este predica se utiliza para controlar la altura maxima de las pilas
		(next ?a1 - altura ?a2 - altura)

		; Indica la altura actual de la pila
		(altura ?p - pila ?t - altura)

  )

  (:action coger-pila
		:parameters (
			?muelle - muelle
			?grua - grua
			?pila - pila
			?contenedor - contenedor
			?altura_pila - altura
			?objeto_base - (either pila contenedor)
			?altura_anterior - altura
		)
		:precondition (
			and
			(libre ?grua)
			(ubicado-en ?grua ?muelle)
			(ubicado-en ?pila ?muelle)
			(ubicado-en ?contenedor ?pila)
			(ubicado-en ?objeto_base ?pila)
			(top ?contenedor ?pila)
			(encima ?contenedor ?objeto_base)
			(disponible ?contenedor)
			(altura ?pila ?altura_pila)
			(next ?altura_anterior ?altura_pila)
		)
		:effect(
			and
			(not (libre ?grua))
			(ubicado-en ?contenedor ?grua)
			(not (ubicado-en ?contenedor ?pila))
			(not (top ?contenedor ?pila))
			(not (encima ?contenedor ?objeto_base))
			(not (disponible ?contenedor))
			(disponible ?objeto_base)
			(top ?objeto_base ?pila)
			(not (altura ?pila ?altura_pila))
			(altura ?pila ?altura_anterior)
		)
  )

  (:action dejar-blanco-pila
		:parameters (
			?muelle - muelle
			?grua - grua
			?pila - pila
			?contenedor - contenedor
			?altura_pila - altura
			?objeto_base - (either pila contenedor)
			?altura_posterior - altura
		)
		:precondition(
			and
			(ubicado-en ?grua ?muelle)
			(ubicado-en ?pila ?muelle)
			(ubicado-en ?contenedor ?grua)
			(ubicado-en ?objeto_base ?pila)
			(top ?objeto_base ?pila)
			(no-verde ?objeto_base)
			(altura ?pila ?altura_pila)
			(next ?altura_pila ?altura_posterior)
		)
		:effect(
			and
			(libre ?grua)
			(ubicado-en ?contenedor ?pila)
			(not (ubicado-en ?contenedor ?grua))
			(encima ?contenedor ?objeto_base)
			(top ?contenedor ?pila)
			(not (top ?objeto_base ?pila))
			(altura ?pila ?altura_posterior)
			(not (altura ?pila ?altura_pila))
			(disponible ?contenedor)
			(not (disponible ?objeto_base))
		)
  )

  (:action dejar-verde-verde
		:parameters (
			?muelle - muelle
			?grua - grua
			?pila - pila
			?contenedor_grua - contenedor
			?altura_pila - altura
			?contenedor_pila - contenedor
			?altura_posterior - altura
		)
		:precondition(
			and
			(ubicado-en ?grua ?muelle)
			(ubicado-en ?pila ?muelle)
			(ubicado-en ?contenedor_grua ?grua)
			(ubicado-en ?contenedor_pila ?pila)
			(top ?contenedor_pila ?pila)
			(verde ?contenedor_grua)
			(verde ?contenedor_pila)
			(altura ?pila ?altura_pila)
			(next ?altura_pila ?altura_posterior)
		)
		:effect(
			and
			(libre ?grua)
			(ubicado-en ?contenedor_grua ?pila)
			(not (ubicado-en ?contenedor_grua ?grua))
			(encima ?contenedor_grua ?contenedor_pila)
			(top ?contenedor_grua ?pila)
			(not (top ?contenedor_pila ?pila))
			(altura ?pila ?altura_posterior)
			(not (altura ?pila ?altura_pila))
			(disponible ?contenedor_grua)
		)
  )

  (:action coger-cinta
	    :parameters (
	    	?cinta - cinta
	    	?muelle_origen - muelle
	    	?muelle_destino - muelle
	    	?grua - grua
	    	?contenedor - contenedor
	    )
		:precondition(
			and
			(libre ?grua)
			(ubicado-en ?grua ?muelle_destino)
			(conecta_a ?cinta ?muelle_origen ?muelle_destino)
			(ubicado-en ?contenedor ?cinta)
		)
		:effect(
			and
			(libre ?cinta)
			(ubicado-en ?contenedor ?grua)
			(not (ubicado-en ?contenedor ?cinta))
			(not (libre ?grua))
			(ubicado-en ?contenedor ?muelle_destino)
		)
  )

  (:action dejar-cinta
	    :parameters (
	    	?cinta - cinta
	    	?muelle_origen - muelle
	    	?muelle_destino - muelle
	    	?grua - grua
	    	?contenedor - contenedor
	    )
		:precondition(
			and
			(libre ?cinta)
			(conecta_a ?cinta ?muelle_origen ?muelle_destino)
			(ubicado-en ?grua ?muelle_origen)
			(ubicado-en ?contenedor ?grua)
			(ubicado-en ?contenedor ?muelle_origen)
		)
		:effect(
			and
			(libre ?grua)
			(not (ubicado-en ?contenedor ?grua))
			(ubicado-en ?contenedor ?cinta)
			(not (libre ?cinta))
			(not (ubicado-en ?contenedor ?muelle_origen))
		)
  )
)

; problem
(define (problem problema_simple) 
(:domain puerto)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; PUERTO Prob. Enunciado de Daniel P. y Alejandro G.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(:objects 
    grua1 - grua
    grua2 - grua

    pila1 - pila
    pila2 - pila
    pila3 - pila
    pila4 - pila
    pila5 - pila
    pila6 - pila

    muelle1 - muelle
    muelle2 - muelle

    cinta1 - cinta
    cinta2 - cinta

    contenedor1 - contenedor
    contenedor2 - contenedor
    contenedor3 - contenedor
    contenedor4 - contenedor
    contenedor5 - contenedor
    contenedor6 - contenedor
    contenedor7 - contenedor
    contenedor8 - contenedor
    contenedor9 - contenedor
    contenedor10 - contenedor
    contenedor11 - contenedor

    altura0 - altura
    altura1 - altura
    altura2 - altura
    altura3 - altura
)

(:init

    ; Muelle donde se encuentra cada contenedor
    (ubicado-en contenedor1 muelle1)
    (ubicado-en contenedor7 muelle1)
    (ubicado-en contenedor9 muelle1)
    (ubicado-en contenedor10 muelle1)
    (ubicado-en contenedor11 muelle1)

    (ubicado-en contenedor8 muelle2)
    (ubicado-en contenedor4 muelle2)
    (ubicado-en contenedor3 muelle2)
    (ubicado-en contenedor2 muelle2)
    (ubicado-en contenedor5 muelle2)
    (ubicado-en contenedor6 muelle2)

    ; Contenedores en sus pilas
    (ubicado-en contenedor1 pila1)
    (ubicado-en contenedor7 pila1)
    (ubicado-en contenedor9 pila2)
    (ubicado-en contenedor10 pila2)
    (ubicado-en contenedor11 pila3)

    (ubicado-en contenedor4 pila4)
    (ubicado-en contenedor8 pila4)
    (ubicado-en contenedor5 pila5)
    (ubicado-en contenedor3 pila5)
    (ubicado-en contenedor2 pila5)
    (ubicado-en contenedor6 pila6)

    ; Pilas en sus muelles
    (ubicado-en pila1 muelle1)
    (ubicado-en pila2 muelle1)
    (ubicado-en pila3 muelle1)

    (ubicado-en pila4 muelle2)
    (ubicado-en pila5 muelle2)
    (ubicado-en pila6 muelle2)

    ; Orden de los contenedores en cada pila
    (encima contenedor7 contenedor1)
    (encima contenedor1 pila1)

    (encima contenedor10 contenedor9)
    (encima contenedor9 pila2)

    (encima contenedor11 pila3)

    (encima contenedor8 contenedor4)
    (encima contenedor4 pila4)

    (encima contenedor2 contenedor3)
    (encima contenedor3 contenedor5)
    (encima contenedor5 pila5)

    (encima  contenedor6 pila6)

    ; Gruas en sus muelles
    (ubicado-en grua1 muelle1)
    (ubicado-en grua2 muelle2)

    ; Conexion carriles de cinta
    (conecta_a cinta1 muelle1 muelle2)
    (conecta_a cinta2 muelle2 muelle1)

    ; Tops de las pilas
    (top contenedor7 pila1)
    (top contenedor10 pila2)
    (top contenedor11 pila3)
    (top contenedor8 pila4)
    (top contenedor2 pila5 )
    (top contenedor6 pila6)

    ; Control de alturas
    (next altura0 altura1)
    (next altura1 altura2)
    (next altura2 altura3)

    ; Gruas y carriles de cinta libres
    (libre grua1)
    (libre grua2)
    (libre cinta1)
    (libre cinta2)

    ; Altura actual de cada pila contando sus contenedores
    (altura pila1 altura2)
    (altura pila2 altura2)
    (altura pila3 altura1)
    (altura pila4 altura2)
    (altura pila5 altura3)
    (altura pila6 altura1)

    ; Contendores disponibles
    (disponible contenedor7)
    (disponible contenedor10)
    (disponible contenedor11)
    (disponible contenedor8)
    (disponible contenedor2)
    (disponible contenedor6)

    ; Contenedores verdes
    (verde contenedor3)
    (verde contenedor4)
    (verde contenedor7)

    ; Contenedores no verdes
    (no-verde contenedor1)
    (no-verde contenedor2)
    (no-verde contenedor5)
    (no-verde contenedor6)
    (no-verde contenedor8)
    (no-verde contenedor9)
    (no-verde contenedor10)
    (no-verde contenedor11)

    ; Hay que marcar que las pilas son no verdes
    (no-verde pila1)
    (no-verde pila2)
    (no-verde pila3)
    (no-verde pila4)
    (no-verde pila5)
    (no-verde pila6)

    ; Hay que ubicar una pila en si misma para poder dejar contenedores en pilas vacias
    (ubicado-en pila1 pila1)
    (ubicado-en pila2 pila2)
    (ubicado-en pila3 pila3)
    (ubicado-en pila5 pila5)
    (ubicado-en pila6 pila6)
    (ubicado-en pila4 pila4)
)

(:goal (and
    (ubicado-en contenedor3 muelle1)
    (ubicado-en contenedor4 muelle1)
    (ubicado-en contenedor7 muelle1)

    (disponible contenedor3)
    (disponible contenedor4)
    (disponible contenedor7)
))

)

; plan
1. (coger-pila muelle2 grua2 pila4 contenedor8 altura2 contenedor4 altura1)
   deleted: (libre grua2) (ubicado-en contenedor8 pila4) (top contenedor8 pila4) (encima contenedor8 contenedor4) (disponible contenedor8) (altura pila4 altura2)
   added: (ubicado-en contenedor8 grua2) (disponible contenedor4) (top contenedor4 pila4) (altura pila4 altura1)
   goals met: 3 of 6
2. (dejar-blanco-pila muelle2 grua2 pila6 contenedor8 altura1 contenedor6 altura2)
   deleted: (ubicado-en contenedor8 grua2) (top contenedor6 pila6) (altura pila6 altura1) (disponible contenedor6)
   added: (libre grua2) (ubicado-en contenedor8 pila6) (encima contenedor8 contenedor6) (top contenedor8 pila6) (altura pila6 altura2) (disponible contenedor8)
   goals met: 3 of 6
3. (coger-pila muelle2 grua2 pila4 contenedor4 altura1 pila4 altura0)
   deleted: (libre grua2) (ubicado-en contenedor4 pila4) (top contenedor4 pila4) (encima contenedor4 pila4) (disponible contenedor4) (altura pila4 altura1)
   added: (ubicado-en contenedor4 grua2) (disponible pila4) (top pila4 pila4) (altura pila4 altura0)
   goals met: 2 of 6
4. (dejar-cinta cinta2 muelle2 muelle1 grua2 contenedor4)
   deleted: (ubicado-en contenedor4 grua2) (libre cinta2) (ubicado-en contenedor4 muelle2)
   added: (libre grua2) (ubicado-en contenedor4 cinta2)
   goals met: 2 of 6
5. (coger-cinta cinta2 muelle2 muelle1 grua1 contenedor4)
   deleted: (ubicado-en contenedor4 cinta2) (libre grua1)
   added: (libre cinta2) (ubicado-en contenedor4 grua1) (ubicado-en contenedor4 muelle1)
   goals met: 3 of 6
6. (coger-pila muelle2 grua2 pila5 contenedor2 altura3 contenedor3 altura2)
   deleted: (libre grua2) (ubicado-en contenedor2 pila5) (top contenedor2 pila5) (encima contenedor2 contenedor3) (disponible contenedor2) (altura pila5 altura3)
   added: (ubicado-en contenedor2 grua2) (disponible contenedor3) (top contenedor3 pila5) (altura pila5 altura2)
   goals met: 4 of 6
7. (dejar-blanco-pila muelle2 grua2 pila6 contenedor2 altura2 contenedor8 altura3)
   deleted: (ubicado-en contenedor2 grua2) (top contenedor8 pila6) (altura pila6 altura2) (disponible contenedor8)
   added: (libre grua2) (ubicado-en contenedor2 pila6) (encima contenedor2 contenedor8) (top contenedor2 pila6) (altura pila6 altura3) (disponible contenedor2)
   goals met: 4 of 6
8. (dejar-blanco-pila muelle1 grua1 pila2 contenedor4 altura2 contenedor10 altura3)
   deleted: (ubicado-en contenedor4 grua1) (top contenedor10 pila2) (altura pila2 altura2) (disponible contenedor10)
   added: (libre grua1) (ubicado-en contenedor4 pila2) (encima contenedor4 contenedor10) (top contenedor4 pila2) (altura pila2 altura3) (disponible contenedor4)
   goals met: 5 of 6
9. (coger-pila muelle2 grua2 pila5 contenedor3 altura2 contenedor5 altura1)
   deleted: (libre grua2) (ubicado-en contenedor3 pila5) (top contenedor3 pila5) (encima contenedor3 contenedor5) (disponible contenedor3) (altura pila5 altura2)
   added: (ubicado-en contenedor3 grua2) (disponible contenedor5) (top contenedor5 pila5) (altura pila5 altura1)
   goals met: 4 of 6
10. (dejar-cinta cinta2 muelle2 muelle1 grua2 contenedor3)
   deleted: (ubicado-en contenedor3 grua2) (libre cinta2) (ubicado-en contenedor3 muelle2)
   added: (libre grua2) (ubicado-en contenedor3 cinta2)
   goals met: 4 of 6
11. (coger-cinta cinta2 muelle2 muelle1 grua1 contenedor3)
   deleted: (ubicado-en contenedor3 cinta2) (libre grua1)
   added: (libre cinta2) (ubicado-en contenedor3 grua1) (ubicado-en contenedor3 muelle1)
   goals met: 5 of 6
12. (dejar-blanco-pila muelle1 grua1 pila3 contenedor3 altura1 contenedor11 altura2)
   deleted: (ubicado-en contenedor3 grua1) (top contenedor11 pila3) (altura pila3 altura1) (disponible contenedor11)
   added: (libre grua1) (ubicado-en contenedor3 pila3) (encima contenedor3 contenedor11) (top contenedor3 pila3) (altura pila3 altura2) (disponible contenedor3)
   goals met: 6 of 6
